import NextAuth, { type DefaultSession } from "next-auth"
 
declare module "next-auth" {
  // Returned by `useSession`, `getSession` and received as a prop on the `SessionProvider` React Context
  interface Session {
    // A JWT which can be used as Authorization header with supabase-js for RLS.
    supabaseAccessToken?: string
    user: {
      prefix: 'นาย' | 'นาง' | 'นางสาว',
      age: number,
      telephone: string,
      province: 
        "กรุงเทพมหานคร" | "สมุทรปราการ" | "นนทบุรี" | "ปทุมธานี" | "สมุทรสาคร" | "พระนครศรีอยุธยา" | 
        "อ่างทอง" | "ลพบุรี" | "สิงห์บุรี" | "ชัยนาท" | "สระบุรี" | "ชลบุรี" | "ระยอง" | "จันทบุรี" | 
        "ตราด" | "ฉะเชิงเทรา" | "ปราจีนบุรี" | "นครนายก" | "สระแก้ว" | "นครราชสีมา" | "บุรีรัมย์" | 
        "สุรินทร์" | "ศรีสะเกษ" | "อุบลราชธานี" | "ยโสธร" | "ชัยภูมิ" | "อำนาจเจริญ" | "บึงกาฬ" | 
        "หนองบัวลำภู" | "ขอนแก่น" | "อุดรธานี" | "เลย" | "หนองคาย" | "มหาสารคาม" | "ร้อยเอ็ด" | 
        "กาฬสินธุ์" | "สกลนคร" | "นครพนม" | "มุกดาหาร" | "เชียงใหม่" | "ลำพูน" | "ลำปาง" | 
        "อุตรดิตถ์" | "แพร่" | "น่าน" | "พะเยา" | "เชียงราย" | "แม่ฮ่องสอน" | "นครสวรรค์" | 
        "อุทัยธานี" | "กำแพงเพชร" | "ตาก" | "สุโขทัย" | "พิษณุโลก" | "พิจิตร" | "เพชรบูรณ์" | 
        "ราชบุรี" | "กาญจนบุรี" | "สุพรรณบุรี" | "นครปฐม" | "สมุทรสงคราม" | "เพชรบุรี" | 
        "ประจวบคีรีขันธ์" | "ชุมพร" | "ระนอง" | "สุราษฎร์ธานี" | "พังงา" | "ภูเก็ต" | "กระบี่" | 
        "นครศรีธรรมราช" | "ตรัง" | "พัทลุง" | "สตูล" | "สงขลา" | "ปัตตานี" | "ยะลา" | "นราธิวาส",
        role: string
    } & DefaultSession["user"]
  }
}