export const clubData = [
  {
    name: 'Creative Algorithm',
    act: [
      'วันจันทร์ 16.45-17.45',
      'นําเสนอและแลกเปลี่ยนแนวคิดในการแก้ไขโจทย์ปัญหาที่เตรียมไว้ โดยพิจารณาถึงประสิทธิภาพของแนวคิด ทั้งในแง่ของเวลา และ หน่วยความจําที่ใข่',
      'ร่วมอภิปราย และส่งต่อความรู้ที่ตนมีในการเขียนโปรแกรมให้กับผู้อื่น ใน กิจกรรมทั้งในและนอกชุมนุม',
      'ทำโจทย์เบื้องต้นในเว็บไซต์ที่มีการรวบรวมโจทย์ปัญหาทางคอมพิวเตอร์',
    ],
    benf: [
      'สมาชิกมีความรู้ความเข้าใจในการเขียนโปรแกรมภาษา C++ เพื่อการแข่งขันมากขึ้น สามารถนํา หลักการพื้นฐานมาประยุกต์ใช้ในการแก้ปัญหาของโปรแกรมเพื่อการแข่งขันได้ในระดับพื้นฐาน รวมถึง อภิปรายและแลกเปลี่ยนข้อคิดเห็นกับผู้ที่มีความสนใจในการเขียนโปรแกรมเพื่อเสรมิสร้างความรู้ความ เข้าใจ และเปิดมุมมองใหม่ในการเขียนโปรแกรม',
    ],
    img: ['Alimg01', 'Alimg02'],
    cover: 'Alcov',
    fact: 'ทำไมถึงต้องใช้ภาษา C++ ในการเขียนโปรแกรมเพื่อการแข่งขัน\nก็เพราะว่าภาษา C++ เป็นภาษาที่มีความใกล้เคียงกับภาษาของเครื่อง ทำให้การ execute โปรแกรมทำได้เร็วกว่าภาษาอย่าง Python และ Java รวมถึงการมีอยู่ของ Standard Template Library ในภาษา C++ ทำให้การเขียนโค้ดทำได้เร็วกว่าเดิมมาก เพราะสามารถเรียกใช้โครงสร้างข้อมมูลพื้นฐาน รวมไปถึงอัลกอริทึมยอดนิยมได้อีกด้วย',
    factimg: 'Alfacimg01',
    review: 'Review',
    imgpresent: 'Alpresent',
    textpresent: 'textpresent',
    vidpresent: 'https://drive.google.com/file/d/1F_QCeqjONYxMmJ5OP7SmvqvlhDEVq2ZY/preview',
    about: ['Academics'],
    actabout: [
      'Lecture',
      'Discussion',
      'Group Activity',
      'Practice',
      'Working',
    ],
  },
]
