export const projData = [
  {
    index: 0,
    id: '30BI02-01',
    start: '2022-08-22T10:00:00.000Z',
    end: '2022-08-22T10:10:00.000Z',
    room: 1,
    subj: 'สาขาวิชาชีววิทยาและวิทยาศาสตร์สุขภาพ',
    nameTh:
      'ประสิทธิภาพของเชื้อรา <i>Chaetomium globosum</i> ในการควบคุมเชื้อแบคทีเรีย <i>Erwinia carotovora</i> สาเหตุโรคเน่าเละในคะน้า ',
    nameEn:
      'Efficiency of <i>Chaetomium globosum</i> controlling <i>Erwinia carotovora</i> cause of soft rot in Chinese kale',
    member: ['ญาณพิชญ์ ธีรฉัตรวัฒน์', 'นภัส ธรรมกิจจาธร', 'ณัชชา แสงแก้ว'],
    adv: ['อรวรรณ ปิยะบุญ'],
    ext: '',
    extAdr: '',
    owner: 'อ.อรวรรณ ปิยะบุญ',
    ownerEmail: 'orawan.piy@mwit.ac.th',
    stdEmail: [
      'yanapith.tee_g30@mwit.ac.th',
      'napat.tha_g30@mwit.ac.th',
      'nutcha.san_g30@mwit.ac.th',
    ],
    abs: 'เชื้อแบคทีเรีย <i>Erwinia carotovora</i> เป็นสาเหตุของโรคเน่าเละที่สร้างความเสียหายต่อผลผลิตของพืชตระกูลกะหล่ำโดยเฉพาะคะน้า ปัจจุบันการควบคุมโดยชีววิธีโดยเฉพาะการใช้เชื้อราปฏิปักษ์ <i>Chaetomium globosum</i> มีศักยภาพในการควบคุมโรคพืช งานวิจัยนี้จึงมีจุดประสงค์ในการทดสอบประสิทธิภาพของเชื้อราปฏิปักษ์ <i>C. globosum</i> ในการควบคุมเชื้อแบคทีเรีย <i>E. carotovora</i> ในต้นคะน้า โดยการเลี้ยเชื้อแบคทีเรีย <i>E. carotovora</i> และเชื้อรา <i>C. globosum</i> ให้บริสุทธิ์ด้วยการถ่ายเชื้อใหม่ ต่อมาทดสอบความสามารถในการยับยั้งเชื้อแบคทีเรีย <i>E. carotovora</i> ของเชื้อรา <i>C. globosum</i> ด้วยวิธีการเลี้ยงเชื้อร่วมกัน ผลการทดลองพบว่าเชื้อรา <i>C. globosum</i> มีความสามารถในการยับยั้งเชื้อแบคทีเรีย <i>E. carotovora</i>  นอกจากนี้ได้ทดสอบการใช้เชื้อรา <i>C. globosum</i> ควบคุมการก่อโรคของเชื้อแบคทีเรีย <i>E. carotovora</i>ในใบคะน้า พบว่าการใช้เชื้อรา <i>C. globosum</i> สามารถควบคุมความรุนแรงของเชื้อแบคทีเรีย <i>E. carotovora</i>ในการเกิดโรคบนใบคะน้า ดังนั้นจึงสามารถนำเชื้อรา <i>C. globosum</i> มาประยุกต์ใช้เป็นชีวภัณฑ์เพื่อยับยั้งเชื้อแบคทีเรีย <i>E. carotovora</i> สาเหตุโรคเน่าเละในคะน้าที่เป็นมิตรต่อสิ่งแวดล้อมได้ในอนาคต',
    kw: ['การควบคุมโรคโดยชีววิธี', 'เชื้อราปฏิปักษ์', 'โรคเน่าเละ'],
  },
]
